function p = predict(theta, X)
% PREDICT Îòíåñåíèå îáğàçöà ê êëàññàì 0 èëè 1 ("èñïğàâåí" èëè "íå èñïğàâåí")
% â ïğîöåññå ëèíåéíîé ğåãğåññèè íà îñíîâàíèè îöåíêè theta
% p = PREDICT(theta, X) îáåñïå÷èâàåò êëàññèôèêàöèş X ñ ïîğîãîâûì 
% çíà÷åíèåì 0.5 (ò.å., åñëè çíà÷åíèå ñèãìîèäíîé ôóíêöèè
% sigmoid(theta'*x) >= 0.5, òî ïğèñâîåíèå 1)

m = size(X, 1); % Êîëè÷åñòâî îáó÷àşùèõ îáğàçöîâ

% Òğåáóåòñÿ êîğğåêòíîå âû÷èñëåíèå ıòîé ïåğåìåííîé 
p = zeros(m, 1);

% ====================== ÂÀØ ÊÎÄ ÇÄÅÑÜ ======================

p = sigmoid(X*theta) >= 0.5;
% =========================================================================


end
